muryamuya/auto-spray-esp8266-atmega328p/auto_spray_main/src/auto_spray_main_wifi.cpp
  if (backlight_btn == true && deviceSet.backlight != 0 && deviceSet.backlight != 4)
  {
    lcd.setBacklight(HIGH);
    counter_backlight = millis();
  }

  if (deviceSet.backlight == 1 && backlight_btn == false && millis() - counter_backlight > 3000)
  {
    lcd.setBacklight(LOW);
  }

  if (deviceSet.backlight == 2 && backlight_btn == false && millis() - counter_backlight > 5000)
  {
    lcd.setBacklight(LOW);
  }

  if (deviceSet.backlight == 3 && backlight_btn == false && millis() - counter_backlight > 10000)
  {
    lcd.setBacklight(LOW);
  }

  if (deviceSet.backlight == 4)
  {
    lcd.setBacklight(LOW);
  }
}

unsigned long minuteToMillis(unsigned long minute)
{
  return minute * 60 * 1000;
}

byte decToBcd(byte val)
{ // Convert normal decimal numbers to binary coded decimal
  return ((val / 10 * 16) + (val % 10));
}

byte bcdToDec(byte val)
{ // Convert binary coded decimal to normal decimal numbers
  return ((val / 16 * 10) + (val % 16));
}

void setDS3231time(byte second, byte minute, byte hour, byte dayOfWeek, byte dayOfMonth, byte month, byte year)
{ // sets time and date data to DS3231
  Wire.beginTransmission(RTC_ADDRESS);
  Wire.write(0);                    // set next input to start at the seconds register
  Wire.write(decToBcd(second));     // set seconds
  Wire.write(decToBcd(minute));     // set minutes
  Wire.write(decToBcd(hour));       // set hours
  Wire.write(decToBcd(dayOfWeek));  // set day of week (1=Sunday, 7=Saturday)
  Wire.write(decToBcd(dayOfMonth)); // set date (1 to 31)
  Wire.write(decToBcd(month));      // set month
  Wire.write(decToBcd(year));       // set year (0 to 99)
  Wire.endTransmission();
}

void readDS3231time(byte *second, // Read from RTC
                    byte *minute,
                    byte *hour,
                    byte *dayOfWeek,
                    byte *dayOfMonth,
                    byte *month,
                    byte *year)
{
  Wire.beginTransmission(RTC_ADDRESS);
  Wire.write(0); // set DS3231 register pointer to 00h
  Wire.endTransmission();
  Wire.requestFrom(RTC_ADDRESS, 7); // request seven bytes of data from DS3231 starting from register 00h
  *second = bcdToDec(Wire.read() & 0x7f);
  *minute = bcdToDec(Wire.read());
  *hour = bcdToDec(Wire.read() & 0x3f);
  *dayOfWeek = bcdToDec(Wire.read());
  *dayOfMonth = bcdToDec(Wire.read());
  *month = bcdToDec(Wire.read());
  *year = bcdToDec(Wire.read());
}

void debugging()
{
  Serial.println(temperature.celcius);
  Serial.print("RTC: ");
  Serial.print(RTC.hour);
  Serial.print(":");
  Serial.println(RTC.minute);
  Serial.print("Timer1: ");
  Serial.print(timer1.hour);
  Serial.print(":");
  Serial.println(timer1.minute);
  Serial.println(timer1.setting);
  Serial.print("Timer2: ");
  Serial.print(timer2.hour);
  Serial.print(":");
  Serial.println(timer2.minute);
  Serial.println(timer2.setting);
  Serial.print("Timer3: ");
  Serial.print(timer3.hour);
  Serial.print(":");
  Serial.println(timer3.minute);
  Serial.println(timer3.setting);
  Serial.print("Duration: ");
  Serial.println(minuteToMillis(deviceSet.duration));
  Serial.print("Threshold: ");
  Serial.println(temperature.threshold);
  Serial.print("Backlight: ");
  Serial.println(deviceSet.backlight);
  Serial.println("-----------------------------");
}

// Menu item function ----------------------------------------------------------------

void displayMain()
{
  readDS3231time(&RTC.second, &RTC.minute, &RTC.hour, &RTC.dayOfWeek, &RTC.dayOfMonth, &RTC.month, &RTC.year);
  lcd.setCursor(0, 0);
  lcd.print("Temp:");
  lcd.setCursor(6, 0);
  lcd.print(temperature.celcius);
  lcd.setCursor(11, 0);
  lcd.write((uint8_t)0);
  lcd.setCursor(12, 0);
  lcd.print("C");
  lcd.setCursor(0, 1);
  lcd.print("Time:");
  lcd.setCursor(6, 1);
  if (RTC.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(7, 1);
    lcd.print(RTC.hour);
  }
  else
  {
    lcd.print(RTC.hour);
  }
  lcd.setCursor(8, 1);
  lcd.print(":");
  lcd.setCursor(9, 1);
  if (RTC.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(10, 1);
    lcd.print(RTC.minute);
  }
  else
  {
    lcd.print(RTC.minute);
  }
}

void displayTempSet()
{
  lcd.setCursor(0, 0);
  lcd.print("Temp Threshold");
  lcd.setCursor(0, 1);
  lcd.print(temperature.threshold);
  lcd.setCursor(4, 1);
  lcd.write((uint8_t)0);
  lcd.setCursor(5, 1);
  lcd.print("C");
}

void displayTempSetEdit()
{
  lcd.setCursor(0, 0);
  lcd.print("Temp Threshold");
  lcd.setCursor(4, 1);
  lcd.write((uint8_t)0);
  lcd.setCursor(5, 1);
  lcd.print("C");
}

void displayTimeSet()
{
  lcd.setCursor(0, 0);
  lcd.print("Timer");

  lcd.setCursor(8, 0);
  lcd.write((uint8_t)1);
  lcd.setCursor(10, 0);
  if (timer1.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(11, 0);
    lcd.print(timer1.hour);
  }
  else
  {
    lcd.print(timer1.hour);
  }
  lcd.setCursor(12, 0);
  lcd.print(":");
  lcd.setCursor(13, 0);
  if (timer1.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(14, 0);
    lcd.print(timer1.minute);
  }
  else
  {
    lcd.print(timer1.minute);
  }

  lcd.setCursor(0, 1);
  lcd.write((uint8_t)2);
  lcd.setCursor(2, 1);
  if (timer2.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(3, 1);
    lcd.print(timer2.hour);
  }
  else
  {
    lcd.print(timer2.hour);
  }
  lcd.setCursor(4, 1);
  lcd.print(":");
  lcd.setCursor(5, 1);
  if (timer2.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(6, 1);
    lcd.print(timer2.minute);
  }
  else
  {
    lcd.print(timer2.minute);
  }

  lcd.setCursor(8, 1);
  lcd.write((uint8_t)3);
  lcd.setCursor(10, 1);
  if (timer3.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(11, 1);
    lcd.print(timer3.hour);
  }
  else
  {
    lcd.print(timer3.hour);
  }
  lcd.setCursor(12, 1);
  lcd.print(":");
  lcd.setCursor(13, 1);
  if (timer3.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(14, 1);
    lcd.print(timer3.minute);
  }
  else
  {
    lcd.print(timer3.minute);
  }
}

void displayTimeSetT1Hour()
{
  lcd.setCursor(0, 0);
  lcd.print("Timer");

  lcd.setCursor(8, 0);
  lcd.write((uint8_t)1);
  lcd.setCursor(12, 0);
  lcd.print(":");
  lcd.setCursor(13, 0);
  if (timer1.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(14, 0);
    lcd.print(timer1.minute);
  }
  else
  {
    lcd.print(timer1.minute);
  }

