muryamuya/auto-spray-esp8266-atmega328p/auto_spray_main/src/auto_spray_main_wifi.cpp
  lcd.setCursor(0, 1);
  lcd.write((uint8_t)2);
  lcd.setCursor(2, 1);
  if (timer2.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(3, 1);
    lcd.print(timer2.hour);
  }
  else
  {
    lcd.print(timer2.hour);
  }
  lcd.setCursor(4, 1);
  lcd.print(":");
  lcd.setCursor(5, 1);
  if (timer2.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(6, 1);
    lcd.print(timer2.minute);
  }
  else
  {
    lcd.print(timer2.minute);
  }

  lcd.setCursor(8, 1);
  lcd.write((uint8_t)3);
  lcd.setCursor(10, 1);
  if (timer3.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(11, 1);
    lcd.print(timer3.hour);
  }
  else
  {
    lcd.print(timer3.hour);
  }
  lcd.setCursor(12, 1);
  lcd.print(":");
  lcd.setCursor(13, 1);
  if (timer3.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(14, 1);
    lcd.print(timer3.minute);
  }
  else
  {
    lcd.print(timer3.minute);
  }
}

void displayTimeSetT1Minute()
{
  lcd.setCursor(0, 0);
  lcd.print("Timer");

  lcd.setCursor(8, 0);
  lcd.write((uint8_t)1);
  lcd.setCursor(10, 0);
  if (timer1.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(11, 0);
    lcd.print(timer1.hour);
  }
  else
  {
    lcd.print(timer1.hour);
  }
  lcd.setCursor(12, 0);
  lcd.print(":");

  lcd.setCursor(0, 1);
  lcd.write((uint8_t)2);
  lcd.setCursor(2, 1);
  if (timer2.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(3, 1);
    lcd.print(timer2.hour);
  }
  else
  {
    lcd.print(timer2.hour);
  }
  lcd.setCursor(4, 1);
  lcd.print(":");
  lcd.setCursor(5, 1);
  if (timer2.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(6, 1);
    lcd.print(timer2.minute);
  }
  else
  {
    lcd.print(timer2.minute);
  }

  lcd.setCursor(8, 1);
  lcd.write((uint8_t)3);
  lcd.setCursor(10, 1);
  if (timer3.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(11, 1);
    lcd.print(timer3.hour);
  }
  else
  {
    lcd.print(timer3.hour);
  }
  lcd.setCursor(12, 1);
  lcd.print(":");
  lcd.setCursor(13, 1);
  if (timer3.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(14, 1);
    lcd.print(timer3.minute);
  }
  else
  {
    lcd.print(timer3.minute);
  }
}

void displayTimeSetT2Hour()
{
  lcd.setCursor(0, 0);
  lcd.print("Timer");

  lcd.setCursor(8, 0);
  lcd.write((uint8_t)1);
  lcd.setCursor(10, 0);
  if (timer1.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(11, 0);
    lcd.print(timer1.hour);
  }
  else
  {
    lcd.print(timer1.hour);
  }
  lcd.setCursor(12, 0);
  lcd.print(":");
  lcd.setCursor(13, 0);
  if (timer1.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(14, 0);
    lcd.print(timer1.minute);
  }
  else
  {
    lcd.print(timer1.minute);
  }

  lcd.setCursor(0, 1);
  lcd.write((uint8_t)2);
  lcd.setCursor(4, 1);
  lcd.print(":");
  lcd.setCursor(5, 1);
  if (timer2.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(6, 1);
    lcd.print(timer2.minute);
  }
  else
  {
    lcd.print(timer2.minute);
  }

  lcd.setCursor(8, 1);
  lcd.write((uint8_t)3);
  lcd.setCursor(10, 1);
  if (timer3.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(11, 1);
    lcd.print(timer3.hour);
  }
  else
  {
    lcd.print(timer3.hour);
  }
  lcd.setCursor(12, 1);
  lcd.print(":");
  lcd.setCursor(13, 1);
  if (timer3.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(14, 1);
    lcd.print(timer3.minute);
  }
  else
  {
    lcd.print(timer3.minute);
  }
}

void displayTimeSetT2Minute()
{
  lcd.setCursor(0, 0);
  lcd.print("Timer");

  lcd.setCursor(8, 0);
  lcd.write((uint8_t)1);
  lcd.setCursor(10, 0);
  if (timer1.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(11, 0);
    lcd.print(timer1.hour);
  }
  else
  {
    lcd.print(timer1.hour);
  }
  lcd.setCursor(12, 0);
  lcd.print(":");
  lcd.setCursor(13, 0);
  if (timer1.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(14, 0);
    lcd.print(timer1.minute);
  }
  else
  {
    lcd.print(timer1.minute);
  }

  lcd.setCursor(0, 1);
  lcd.write((uint8_t)2);
  lcd.setCursor(2, 1);
  if (timer2.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(3, 1);
    lcd.print(timer2.hour);
  }
  else
  {
    lcd.print(timer2.hour);
  }
  lcd.setCursor(4, 1);
  lcd.print(":");

  lcd.setCursor(8, 1);
  lcd.write((uint8_t)3);
  lcd.setCursor(10, 1);
  if (timer3.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(11, 1);
    lcd.print(timer3.hour);
  }
  else
  {
    lcd.print(timer3.hour);
  }
  lcd.setCursor(12, 1);
  lcd.print(":");
  lcd.setCursor(13, 1);
  if (timer3.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(14, 1);
    lcd.print(timer3.minute);
  }
  else
  {
    lcd.print(timer3.minute);
  }
}

void displayTimeSetT3Hour()
{
  lcd.setCursor(0, 0);
  lcd.print("Timer");

  lcd.setCursor(8, 0);
  lcd.write((uint8_t)1);
  lcd.setCursor(10, 0);
  if (timer1.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(11, 0);
    lcd.print(timer1.hour);
  }
  else
  {
    lcd.print(timer1.hour);
  }
  lcd.setCursor(12, 0);
  lcd.print(":");
  lcd.setCursor(13, 0);
  if (timer1.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(14, 0);
    lcd.print(timer1.minute);
  }
  else
  {
    lcd.print(timer1.minute);
  }

  lcd.setCursor(0, 1);
  lcd.write((uint8_t)2);
  lcd.setCursor(2, 1);
  if (timer2.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(3, 1);
    lcd.print(timer2.hour);
  }
  else
  {
    lcd.print(timer2.hour);
  }
  lcd.setCursor(4, 1);
  lcd.print(":");
  lcd.setCursor(5, 1);
  if (timer2.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(6, 1);
    lcd.print(timer2.minute);
  }
  else
  {
    lcd.print(timer2.minute);
  }

  lcd.setCursor(8, 1);
  lcd.write((uint8_t)3);
  lcd.setCursor(12, 1);
  lcd.print(":");
  lcd.setCursor(13, 1);
  if (timer3.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(14, 1);
    lcd.print(timer3.minute);
  }
  else
  {
    lcd.print(timer3.minute);
  }
}

void displayTimeSetT3Minute()
{
  lcd.setCursor(0, 0);
  lcd.print("Timer");

  lcd.setCursor(8, 0);
  lcd.write((uint8_t)1);
  lcd.setCursor(10, 0);
  if (timer1.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(11, 0);
    lcd.print(timer1.hour);
  }
  else
  {
    lcd.print(timer1.hour);
  }
  lcd.setCursor(12, 0);
  lcd.print(":");
  lcd.setCursor(13, 0);
  if (timer1.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(14, 0);
    lcd.print(timer1.minute);
  }
  else
  {
    lcd.print(timer1.minute);
  }

