muryamuya/auto-spray-esp8266-atmega328p/auto_spray_main/src/auto_spray_main_wifi.cpp
  if (state == 2 && btn_set == 3)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (timer2.hour < 23)
      {
        timer2.hour++;
      }
      else
      {
        timer2.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (timer2.hour > 0)
      {
        timer2.hour--;
      }
      else
      {
        timer2.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 4;
    }
  }

  if (state == 2 && btn_set == 4)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (timer2.minute < 59)
      {
        timer2.minute++;
      }
      else if (timer2.hour < 23)
      {
        timer2.minute = 0;
        timer2.hour++;
      }
      else
      {
        timer2.minute = 0;
        timer2.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (timer2.minute > 0)
      {
        timer2.minute--;
      }
      else if (timer2.hour > 0)
      {
        timer2.minute = 59;
        timer2.hour--;
      }
      else
      {
        timer2.minute = 59;
        timer2.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 5;
    }
  }

  if (state == 2 && btn_set == 5)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (timer3.hour < 23)
      {
        timer3.hour++;
      }
      else
      {
        timer3.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (timer3.hour > 0)
      {
        timer3.hour--;
      }
      else
      {
        timer3.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 6;
    }
  }

  if (state == 2 && btn_set == 6)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (timer3.minute < 59)
      {
        timer3.minute++;
      }
      else if (timer3.hour < 23)
      {
        timer3.minute = 0;
        timer3.hour++;
      }
      else
      {
        timer3.minute = 0;
        timer3.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (timer3.minute > 0)
      {
        timer3.minute--;
      }
      else if (timer3.hour > 0)
      {
        timer3.minute = 59;
        timer3.hour--;
      }
      else
      {
        timer3.minute = 59;
        timer3.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      EEPROM.put(6, timer1.hour);
      EEPROM.put(7, timer1.minute);
      EEPROM.put(9, timer2.hour);
      EEPROM.put(10, timer2.minute);
      EEPROM.put(12, timer3.hour);
      EEPROM.put(13, timer3.minute);
      EEPROM.commit();
      btn_set = 0;
    }
  }

  if (state == 3 && btn_set == 1)
  {
    if (buttonRead(buttonUp) == true)
    {
      timer1.setting = 1;
    }
    if (buttonRead(buttonDown) == true)
    {
      timer1.setting = 0;
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 2;
    }
  }

  if (state == 3 && btn_set == 2)
  {
    if (buttonRead(buttonUp) == true)
    {
      timer2.setting = 1;
    }
    if (buttonRead(buttonDown) == true)
    {
      timer2.setting = 0;
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 3;
    }
  }

  if (state == 3 && btn_set == 3)
  {
    if (buttonRead(buttonUp) == true)
    {
      timer3.setting = 1;
    }
    if (buttonRead(buttonDown) == true)
    {
      timer3.setting = 0;
    }
    if (buttonRead(buttonSet) == true)
    {
      EEPROM.put(8, timer1.setting);
      EEPROM.put(11, timer2.setting);
      EEPROM.put(14, timer3.setting);
      EEPROM.commit();
      btn_set = 0;
    }
  }

  if (state == 4 && btn_set == 1)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (deviceSet.duration < 60)
      {
        deviceSet.duration++;
      }
      else
      {
        deviceSet.duration = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (deviceSet.duration > 1)
      {
        deviceSet.duration--;
      }
      else
      {
        deviceSet.duration = 60;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      EEPROM.put(5, deviceSet.duration);
      EEPROM.commit();
      btn_set = 0;
    }
  }

  if (state == 5 && btn_set == 1)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (deviceSet.backlight > 0)
      {
        deviceSet.backlight--;
      }
      else
      {
        deviceSet.backlight = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (deviceSet.backlight < 4)
      {
        deviceSet.backlight++;
      }
      else
      {
        deviceSet.backlight = 4;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      EEPROM.put(4, deviceSet.backlight);
      EEPROM.commit();
      btn_set = 0;
    }
  }

  if (state == 6 && btn_set == 1)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (RTC.hour < 23)
      {
        RTC.hour++;
      }
      else
      {
        RTC.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (RTC.hour > 0)
      {
        RTC.hour--;
      }
      else
      {
        RTC.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 2;
    }
  }

  if (state == 6 && btn_set == 2)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (RTC.minute < 59)
      {
        RTC.minute++;
      }
      else if (RTC.hour < 23)
      {
        RTC.minute = 0;
        RTC.hour++;
      }
      else
      {
        RTC.minute = 0;
        RTC.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (RTC.minute > 0)
      {
        RTC.minute--;
      }
      else if (RTC.hour > 0)
      {
        RTC.minute = 59;
        RTC.hour--;
      }
      else
      {
        RTC.minute = 59;
        RTC.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      setDS3231time(00, RTC.minute, RTC.hour, 7, 01, 10, 22);
      btn_set = 0;
    }
  }

  if (state == 7 && btn_set == 1)
  {
    if (buttonRead(buttonUp) == true || buttonRead(buttonDown) == true)
    {
      lcd.clear();
      btn_set = 0;
    }
    if (buttonRead(buttonSet) == true)
    {
      factoryReset();
      lcd.clear();
      lcd.setCursor(4, 0);
      lcd.print("Success!");
      delay(2000);
      lcd.clear();
      btn_set = 0;
      state = 0;
    }
  }
}

// Web function ----------------------------------------------

void setupServer(){
  webServer.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
      request->send(LittleFS, "/index.html","text/html", false);
  });
}

// Main function ---------------------------------------------

void setup()
{
  //Serial.begin(9600);
  EEPROM.begin(EEPROM_SIZE);
  fetchEEPROM();
  /*
  if(!LittleFS.begin()){
    Serial.println("An Error has occurred while mounting LittleFS");
    return;
  }
  File file = LittleFS.open("/index.html", "r");
  if(!file){
    Serial.println("Failed to open file for reading");
    return;
  }
  
  Serial.println("File Content:");
  while(file.available()){
    Serial.write(file.read());
  }
  file.close();
  */
  Wire.begin(1);
  pinMode(buttonUp, INPUT_PULLUP);
  pinMode(buttonDown, INPUT_PULLUP);
  pinMode(buttonSet, INPUT_PULLUP);
  lcd.init();
  lcd.backlight();
  lcd.createChar(0, charDegree);
  lcd.createChar(1, charT1);
  lcd.createChar(2, charT2);
  lcd.createChar(3, charT3);
  lcd.setCursor(0, 0);
  lcd.print("Multitechnologi");
  delay(3000);
  lcd.clear();
  WiFi.mode(WIFI_AP);
  WiFi.softAPConfig(APIP, APIP, subnet_mask);
  WiFi.softAP(ssid);
  dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
  setupServer();
  webServer.addHandler(new CaptiveRequestHandler()).setFilter(ON_AP_FILTER);
  webServer.begin();
}

void loop()
{
  receiveStatus();
  buttonMenu();
  displayMenu();
  backlightMode();
  sendSettings();
  // debugging();
}
